In [3]:
# !pip install pandas

In [3]:
import pandas as pd

### Creating Data Frame

#### From Dictionary

In [4]:
# 1. From Dictionary
data= {'name':['Alice','Bob','Ram'],
      'age':[25,28,'30']}
df=pd.DataFrame(data)

In [5]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [6]:
df.columns

Index(['name', 'age'], dtype='object')

#### From list of lists

In [7]:
# 2.From lists of lists
data=[['Alice',20],['Bob',29],['Ram',28],['Hari',27],['Shyam',35]]
df=pd.DataFrame(data)

In [8]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [9]:
df.columns

RangeIndex(start=0, stop=2, step=1)

In [10]:
df.columns=['name','age']

In [11]:
df.columns

Index(['name', 'age'], dtype='object')

In [12]:
df=pd.DataFrame(data,columns=['name','age'])

In [13]:
df.columns

Index(['name', 'age'], dtype='object')

 ### Accessing Data

In [14]:
df['name']

0    Alice
1      Bob
2      Ram
3     Hari
4    Shyam
Name: name, dtype: object

In [15]:
type(df['name'])

pandas.core.series.Series

In [16]:
list_col=['name','age']
df[list_col]
# df['name','age']

    name  age
0  Alice   20
1    Bob   29
2    Ram   28
3   Hari   27
4  Shyam   35

#### Condition based Filtering

In [17]:
df['age']>=30

0    False
1    False
2    False
3    False
4     True
Name: age, dtype: bool

In [18]:
df[df['age']>=30]
# like mask

    name  age
4  Shyam   35

In [20]:
df[df['name'].str.startswith('A')&(df['age']>=20)]

    name  age
0  Alice   20

In [21]:
df['age'].isna()

0    False
1    False
2    False
3    False
4    False
Name: age, dtype: bool

In [24]:
df[df['age'].isna()]

Empty DataFrame
Columns: [name, age]
Index: []

### Filtering using existing methods

In [26]:
df.loc[0,'name']

'Alice'

In [32]:
df.loc[0:1,['name','age']]
#df.loc[0:1]

    name  age
0  Alice   20
1    Bob   29

In [38]:
df.iloc[2,0]
#[2,0] is matrix location

'Ram'

In [40]:
df.iloc[0:2,[0,1]]

    name  age
0  Alice   20
1    Bob   29

In [45]:
#single cell grab
df.at[0,'name']

'Alice'

### Reading and writing data

In [87]:
df=pd.read_csv('./../data.csv')
#./=current folder day-22
#../=step out from current folder

In [90]:
df

      name   age
0    Alice  25.0
1      Bob  30.0
2  Charlie  33.0
3  Charlie  33.0

In [93]:
df.loc[2,'name']='Charlie'
df.loc[2,'age']=33
df.loc[3,'name']='Abcde'
df.loc[3,'age']=31

In [94]:
df

      name   age
0    Alice  25.0
1      Bob  30.0
2  Charlie  33.0
3    Abcde  31.0

In [95]:
df.to_csv('./../data.csv',index=False)

### Data Exploration

In [96]:
df.head()

      name   age
0    Alice  25.0
1      Bob  30.0
2  Charlie  33.0
3    Abcde  31.0

In [97]:
df.head(2)

    name   age
0  Alice  25.0
1    Bob  30.0

In [98]:
df.tail(2)

      name   age
2  Charlie  33.0
3    Abcde  31.0

In [99]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   age     4 non-null      float64
dtypes: float64(1), object(1)
memory usage: 196.0+ bytes

In [101]:
df.describe()
#only numercial values obtained

            age
count   4.00000
mean   29.75000
std     3.40343
min    25.00000
25%    28.75000
50%    30.50000
75%    31.50000
max    33.00000

In [102]:
df.value_counts()

name     age
Abcde    31.0    1
Alice    25.0    1
Bob      30.0    1
Charlie  33.0    1
Name: count, dtype: int64

In [109]:
df['age'].nunique()

4

In [110]:

df['age'].unique()

array([25., 30., 33., 31.])

In [111]:
df.shape

(4, 2)

In [113]:
df.isnull()

    name    age
0  False  False
1  False  False
2  False  False
3  False  False

In [114]:
df.isnull().sum()

name    0
age     0
dtype: int64